[
    {
        "citation": "Pearson, D., Giles-Corti, B., Zapata-Diomedi, B., & Higgs, C. (2025). Is Victoria’s Planning System Designed to Deliver Health Supportive and Liveable Cities? Urban Policy and Research, 43(1), 1–16. https://doi.org/10.1080/08111146.2025.2481507",
        "title": "Is Victoria’s Planning System Designed to Deliver Health Supportive and Liveable Cities?",
        "category": "articles",
        "description": "Creating liveable cities is a global priority reflected in the planning policies of Australia’s second largest city, Melbourne, in the state of Victoria. Yet, a gap persists between policy and on-the-ground outcomes. This study explored whether Victoria’s planning system supports these ambitions, using mixed methods to assess how regulations shape neighbourhood liveability. Features contributing to liveability were mapped across four Greenfield case study areas and compared with planning regulations. Among other issues, identified gaps clearly inhibit public and active transport provision, reinforcing car use. Without reform, new developments will continue to reinforce car dependency, undermining efforts to create health supportive and liveable urban environments.",
        "formats": "online/PDF",
        "url": "https://doi.org/10.1080/08111146.2025.2481507",
        "year" : "2025"
    },
    {
        "citation": "Bandara TN, Turrell G, De Livera A, Zapata-Diomedi B, Gunn L. Exploring sex differences in the longitudinal association between streetlighting and transport walking. Health & place. 2025;93:103442. doi: https://doi.org/10.1016/j.healthplace.2025.103442.",
        "title": "Exploring sex differences in the longitudinal association between streetlighting and transport walking",
        "category": "articles",
        "description": "Regular physical activity, such as transport walking, is essential for health, yet many adults do not meet recommended physical activity levels. The built environment, particularly streetlighting, plays a critical role in promoting transport walking. However, existing evidence on the relationship between streetlighting and transport walking is largely cross-sectional, with limited longitudinal research exploring potential sex differences. This study aimed to assess the longitudinal association between objectively measured streetlight count and transport walking among mid-to-older-aged adults in Brisbane, Australia, and to explore whether this association varies by sex. Data were from the How Areas in Brisbane Influence HealTh and AcTivity (HABITAT) study, a multilevel cohort study with five waves over nine years (2007–2016). The analytical sample included participants who did not move during the study. Transport walking was self-reported and dichotomized into walkers and non-walkers. Streetlight counts within a 1 km road network buffer around participants’ homes were measured alongside transport walking. Generalized linear mixed-effects models were used, adjusting for sociodemographic factors, length of stay, neighbourhood preference, and built environment attributes. Higher streetlight counts were positively associated with transport walking (OR 1.002; 95% CI 1.001, 1.002), and the association remained significant after adjusting for residential density, street connectivity, and land-use mix. No significant sex differences were found. This study provides longitudinal evidence that well-lit environments promote transport walking among mid-to-older-aged adults. This finding can inform urban planning and public health policies aimed at encouraging transport walking to help reduce the risk of chronic disease.",
        "formats": "online/PDF",
        "url":"https://doi.org/10.1016/j.healthplace.2025.103442",
        "journal": "Health & place",
        "year" : "2025"
    },
    {
        "title": "Modelling active travel accessibility at the micro-scale using multi-source built environment data",
        "category": "articles",
        "citation": "Staves C, Itova I, Zapata-Diomedi B, de Nazelle A, Panter J, Gunn L, et al. Modelling active travel accessibility at the micro-scale using multi-source built environment data. Computers, Environment and Urban Systems. 2025;119:102270. doi: https://doi.org/10.1016/j.compenvurbsys.2025.102270.",
        "description": "Accessibility models explore how land use and transport systems interact to facilitate access to activities and daily needs. Existing applications generally model accessibility based on distance or travel time. For pedestrians and cyclists, the street-level environment (e.g., green visibility, streetside amenities, dedicated infrastructure) significantly influences people's willingness and ability to travel. Incorporating these features into accessibility models can help them to be more representative of active travellers' experienced environment.\nThis study presents a methodology for incorporating the street-level environment into active mode accessibility. First, micro-scale built environment data from multiple sources are harmonised into a high-resolution digital representation of the land use and transport system. Second, a compute-optimised framework is developed for modelling accessibility at the micro-scale (i.e., each dwelling separately) incorporating the street-level environment. The methods build upon the open geodatabase OpenStreetMap and open-source MATSim project, facilitating expandability and transferability to other contexts. We apply this methodology to develop policy-relevant accessibility indicators for Greater Manchester.\nIn the results, we observe that the street-level environment can cause accessibility indicators to vary at the micro-scale, especially in less connected neighbourhoods where the choice of routes is limited. We also observed that for cyclists, the accessibility advantage over walking reduces substantially when traffic stress is considered. Our findings support further adoption of micro-scale built environment data and high-resolution analysis methods for active travel accessibility modelling in research and practice.",
        "formats": "online/PDF",
        "url": "https://doi.org/10.1016/j.compenvurbsys.2025.102270",
        "year" : "2025"
    },
    {
        "title": "Activity-based and agent-based transport model of Melbourne: an open multi-modal transport simulation model for Greater Melbourne",
        "category": "articles",
        "description": "Activity- and agent-based models for simulating transport systems have attracted significant attention in recent years. However, building these types of models at a city-wide level and including motorized (i.e. cars and public transport) and non-motorized (i.e. walk and bicycle) modes of transport is a complicated and involved task. This paper presents an open workflow for creating large-scale multi-modal agent-based transport simulation models. The workflow brings together a number of external tools, for example, an activity-based demand generation tool and a road network generation tool, and a set of tools developed for the agent-based model parameter estimation, calibration, and simulation post-processing. We used this workflow to create an activity- and agent-based model for Melbourne and compared the output of the simulation model with observations from the real world in terms of mode share, road volume, travel time, and travel distance. Through these comparisons, we showed that our model is suitable for studying mode choice and road usage behavior of travelers. The calibrated model could be used to test road network change interventions. In addition, a similar workflow can be applied for building simulation models for other cities or could be expanded to include more complicated travel behaviors.",
        "formats": "online/PDF",
        "citation": "Jafari, A., Singh, D., Both, A., Abdollahyar, M., Gunn, L., Pemberton, S., & Giles-Corti, B. (2025). Activity-based and agent-based transport model of Melbourne: an open multi-modal transport simulation model for Greater Melbourne. Journal of Intelligent Transportation Systems, 29(4), 417–434. https://doi.org/10.1080/15472450.2024.2372894",
        "url": "https://doi.org/10.1080/15472450.2024.2372894",
        "journal": "Journal of Intelligent Transportation Systems",
        "year" : "2025"
    },
    {
        "title": "The longitudinal effects of the built environment on transportation and recreational walking, and differences by age and sex: systematic review protocol",
        "category": "articles",
        "formats": "online/PDF",
        "citation": "Bandara, T.N., Higgs, C., Zapata-Diomedi, B. et al. The longitudinal effects of the built environment on transportation and recreational walking, and differences by age and sex: systematic review protocol. Arch Public Health 81, 184 (2023). https://doi.org/10.1186/s13690-023-01194-0",
        "description": "In high-income countries, the prevalence of physical inactivity and non-communicable diseases is high, and it is now well-established that insufficient physical activity is a risk factor for non-communicable diseases. Walking for recreation and transportation are effective means of improving population levels of physical activity. Research finds that the built environment (BE) can encourage or discourage walking behaviour, and this association varies for different age groups and sexes. This systematic review aims to synthesise longitudinal evidence to better understand how the BE affects recreational and transportation walking for different age groups (above 64 years and 18–64 years) and sexes in high-income countries.This review will identify BE attributes that are likely to influence transportation and recreational walking for younger and older adults and different sexes in high-income countries. The findings will help policymakers with making decisions around walkable built environments for older and younger adults and different sexes to keep them healthy.  This protocol of the prospective systematic review is developed following PRISMA-P guidelines and is registered on the Prospective Register of Systematic Reviews (PROSPERO) (registration ID CRD42022351919).",
        "journal": "Archives of Public Health",
        "url": "https://doi.org/10.1186/s13690-023-01194-0",
        "year" : "2023"
    },
    {
        "title": "JIBE model methods and outputs",
        "category": "presentations",
        "description": "Through the JIBE project (Joining Impact models of transport with spatial measures of the Built Environment), we have developed agent-based transport simulation models (ABMs) capable of depicting complex urban systems. These ABMs model how street-level built environment exposures influence behaviour, accessibility and health with high spatial and demographic granularity. By forecasting travel itineraries, behaviours, exposures, and health for a synthetic population of individuals, these ABMs allow us to simulate scenarios of interest to health and transport planners. These presentations include an introduction to the projects, methods and outputs.",
        "formats": "PDF",
        "citation": "Zapata-Diomedi, Belen; Zhang, Qin; Staves, Corin; Pemberton, Steve; Abdollahyar, Mahsa (2024). Methods and outputs JIBE model. RMIT University. Presentations. https://doi.org/10.25439/rmt.25965541.v1",
        "licence": "CC BY 4.0",
        "url": "https://doi.org/10.25439/rmt.25965541.v1"
    },
    {
        "title": "Association between Built Environment attributes and Strava speeds and volumes in the Greater Manchester region",
        "category": "presentations",
        "description": "The Built Environment (BE) along the travel network influences the likelihood of people making short or multimodal trips using active travel (AT) modes (i.e., cycling and walking). The literature shows that BE attributes are significant predictors of AT and are strongly correlated with high cycling volumes. Specifically, they have higher association with AT than socio-demographics, or proximity to central locations and green space. Moreover, their collective relationship with AT use is not additive but complex, since many of them are correlated. Existing literature shows that BE attributes at the same time can contribute to delays, comfort and perceived safety levels. There is scarce evidence whether cycling and walking volumes increase if travel delays are reduced, while comfort level credited to high quality walking or cycling infrastructure is improved. In this video we describe how: we examined the association between travel delays for cycling and walking, with the presence and type of intersections' traffic signals, street lighting, crime rates and pavement quality; we compared self-reported speeds and volumes from Strava users in Greater Manchester with the MATSim modelled free-flow speeds (function of the network gradient) and volumes; and we observed travel delays on the network, with some attributes having positive, while others negative effect on speeds and volumes.",
        "formats": "MP4",
        "citation": "Itova, I., C. Staves, S. M. Labib, A. de Nazelle, A. Jafari, J. Woodcock, J. Panter, et al. 'Association between Built Environment Attributes and Strava Speeds and Volumes in the Greater Manchester Region'. Science Talks 8 (1 December 2023): 100268. https://doi.org/10.1016/j.sctalk.2023.100268",
        "licence": "CC BY 4.0",
        "url": "https://doi.org/10.1016/j.sctalk.2023.100268"
    },
    {
        "title": "Integrating spatially detailed micro-environmental attributes to a routable transport network for active travel modeling: A pilot study in Greater Manchester",
        "category": "presentations",
        "description": "Prior studies show that the Built Environment (BE) can influence route and mode choice, increasing the uptake of active modes and reducing car dominance. One of the main challenges in establishing such relationships between the BE and travel behaviour is the unavailability of micro-scale BE data. This study presents a methodology for harmonising and joining multi-source spatial datasets to the unit level of the street segment (link). We observed significant link-level variations of the environmental characteristics, which would have been missed with more traditional area-level approaches. Thus more detailed information of specific street segments can assist travel demand modelling.",
        "formats": "PDF",
        "citation": "Labib, S.M, Irena Itova, Corin Staves, Belén Zapata-Diomedi, Alan Both, Lucy Gunn, Haneen Khreis, et al. 'Integrating Spatially Detailed Micro-Environmental Attributes to a Routable Transport Network for Active Travel Modeling: A Pilot Study in Greater Manchester'. 28 March 2022. https://doi.org/10.5281/zenodo.6411627.",
        "licence": "CC BY 4.0",
        "url": "https://zenodo.org/records/6411627"
    },
    {
        "title": "Incorporating Network-based Built Environmental Attributes of Walkability and Cyclability into Accessibility Modelling: A Pilot Study for Greater Manchester",
        "category": "presentations",
        "description": "Accessibility is a key instrument for assessing active mobility. However, accessibility measures often suffer from biases due to spatial aggregation, isochrones with arbitrary cut-offs, and distance-based cost functions that ignore the route conditions. Previous literature has addressed these issues individually, but not holistically. This study applies the MATSim framework to efficiently route between billions of origin-destination pairs to calculate fully disaggregate Hansen accessibilities using cost functions sensitive to network quality. With examples of greenspace and foodstore accessibility, we demonstrate the potential of this method for providing policy-relevant insight into the suitability of the built environment for active travel.",
        "formats": "PDF",
        "citation": "Staves, Corin, S.M. Labib, Irena Itova, Rolf Moeckel, James Woodcock, and Belen Zapata-Diomedi. 'Incorporating Network-Based Built Environmental Attributes of Walkability and Cyclability into Accessibility Modelling: A Pilot Study for Greater Manchester'. 19 April 2023. https://doi.org/10.5281/zenodo.7825121.",
        "licence": "CC BY 4.0",
        "url": "https://ethz.ch/content/dam/ethz/special-interest/baug/ivt/ivt-dam/events/2023/09/05/abstracts/Staves_EtAl_MUM_2023.pdf"
    },
    {
        "title": "A MATSim-based Framework for Modelling the Influence of the Built Environment on Walkability and Cyclability",
        "category": "presentations",
        "description": "At the 2023 MATSim User Meeting, Corin presented 'A MATSim-based framework to Incorporate High Resolution Built Environment Data for Modelling Walkability and Cyclability.' The MATSim user meeting is the annual meeting for users and developers of the open-source MATSim agent-based transport simulation tool. This study further extended the walkability and cycling accessibility work presented at GISRUK2023 and showcased it to the MATSim community. The primary output of this was a flexible, open-source tool which made use of computationally efficient algorithms in MATSim to quickly calculate walkability and cyclability indicators at any level of precision. We were very pleased to find this to be an engaging presentation for the MATSim community and it also won their 'best paper' award.",
        "formats": "PDF",
        "citation": "Staves, Corin, S.M. Labib, Irena Itova, Qin Zhang, James Woodcock, Rolf Moeckel, and Belen Zapata-Diomedi. 'A MATSim-based Framework for Modelling the Influence of the Built Environment on Walkability and Cyclability'. 2023 MATSim User Meeting. https://doi.org/10.5281/zenodo.7825121.",
        "licence": "CC BY 4.0",
        "url": "https://zenodo.org/records/7825121"
    },
    {
        "title": "JIBE 20 Minute Melbourne Scenario Impacts",
        "category": "data",
        "description": "Data outputs from the JIBE 20 minute neighbourhood intervention. The intervention has two components: 1) the destination component, in which new amenities and services are added to locations in and around defined activity centres to evaluate accessibility and utilisation levels; 2) the cycling component, which evaluates the impact of reducing vehicle speed limits to 40km/h or 30km/h on residential streets.",
        "formats": "CSV, XLSX, RDS, SQLITE",
        "citation": "Pemberton, S., Saghapour, T., Giles-Corti, B., Abdollahyar, M., Both, A., Pearson, D., Higgs, C., Jafari, A., Singh, D., Gunn, L., Woodcock, J., & Zapata-Diomedi, B. (2024). 20-minute neighbourhood scenario modelling for Melbourne (JIBE) (Version 1.0.0) [Computer software]. https://doi.org/10.5281/zenodo.13846250",
        "licence": "ODbL",
        "url": "https://github.com/jibeproject/20mnMelbourne"
    }
]
